%%%-------------------------------------------------------------------
%%% @doc
%%% 用户服务
%%% 负责获取和管理用户配置信息
%%% @end
%%%-------------------------------------------------------------------
-module(user_service).

%% API
-export([get_user_config/1]).

%%====================================================================
%% API 函数
%%====================================================================

%% @doc 获取用户配置
%% 从Redis获取用户配置信息
get_user_config(UserId) ->
    jsx:decode(redis_client:get(<<"user:", UserId/binary>>), [return_maps]).